{"/about":{"title":"About","data":{"":"This is the about page! This page is shown on the navbar."}},"/community":{"title":"Community resources","data":{"tutorials-and-documentation#Tutorials and Documentation":"Modding Tutorial - Wiki version\nShip Editor Tutorial\nHow to add ship to the mod - by InterdictorSD\nModding Live #2 by PMGL\nGeneral modding tutorial by Wolfan","tools#Tools":"Mod Editor\nShip Editor\nMap Editor (by community)","code-resources#Code resources":"Community Mods Archive\nStarblast code reference by Bhpsngum\nStarblast code reference by Wolfan"}},"/content":{"title":"Content","data":{"":"Here is a list of all the files in the documentation."}},"/docs/Main_Code_Parts":{"title":"Main Code Parts","data":{"options#Options":"","definition#Definition":"Stored in this.options is a data structure where you can set options for your custom modded game. These options are used for initializing the game when you start your mod. Changing them while the mod is running does not affect the game.","custom-ships-and-custom-tree#Custom ships and custom tree":"You can import ships made within the Starblast Ship Editor. Use \"Mod Export\" feature to export a JavaScript code snippet for the modding interface. Then paste this snipped in the coding window and add this:\nvar myship_101 = \"{ … … <this is your exported ship code> …\";\r\n\r\nvar ships = [myship_101]; // add your ship to an array of ship\r\n\r\nthis.options = {\r\n  root_mode: \"survival\",\r\n  ships: ships,         // specifying a list of ships to complement / replace existing ships\r\n  reset_tree: true,     // set to true if you want to remove the original ship tree, false if you just want to replace some of the ships\r\n  map_size: 30\r\n};\r\n\r\nthis.tick = function(game) {\r\n};\nThen run your mod. If your ship is set to level=1 model=1, your ship will replace the Fly. You can replace other ships in the tree in a similar way, using reset_tree: false. Or you can remove the original ship tree completely and provide a whole new one using reset_tree: true.","customizing-the-emote-chat-system#Customizing the emote-chat system":"The vocabulary used for the emote-chat system can be customized by setting the field vocabulary in the game option as follows:\nvar vocabulary = [\r\n  { text: \"Hello\", icon: \"\\u0045\", key: \"O\" },\r\n  { text: \"Bye\", icon: \"\\u0046\", key: \"B\" },\r\n  { text: \"Yes\", icon: \"\\u004c\", key: \"Y\" },\r\n  { text: \"No\", icon: \"\\u004d\", key: \"N\" },\r\n\r\n  { text: \"Flower\", icon: \"\\u{1F33B}\", key: \"F\" },\r\n  { text: \"Snowman\", icon: \"\\u26c4\", key: \"M\" },\r\n  { text: \"Shark\", icon: \"\\u{1F988}\", key: \"S\" },\r\n  { text: \"Ghost\", icon: \"\\u{1F47B}\", key: \"G\" }\r\n];\r\n\r\nthis.options = {\r\n  vocabulary: vocabulary,\r\n  // ...\r\n};\nThis allows using Starblast built-in emote icons, which are listed here for reference: https://starblast.io/glyphs.htmlYou can also use unicode icons, here is a good source for reference: https://unicode.org/emoji/charts/full-emoji-list.htmlNote that wide unicode characters (using more than 2 bytes) requires a specific Javascript syntax as shown in the example above (example: \\u{1F47B})","custom-asteroids-maps#Custom asteroids maps":"You can create a custom map of asteroids. This allows creating a maze for example. The custom map you provide is actually a JavaScript character string that is used to \"paint\" the map.For example:\nvar map =\r\n\"999999999999999999999999999999\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"99                          99\\n\"+\r\n\"999999999999999999999999999999\" ;\r\n\r\n\r\nthis.options = {\r\n  custom_map: map,\r\n  map_size: 30\r\n}\nIn the example above, 9 sets the biggest size of the asteroid. You can use smaller values for adding smaller asteroids to the grid. Any value other than a digit will be interpreted as no asteroid. If your map_size is set to 30, make sure to create 30 lines and 30 columns, or you may get unpredictable results.Note: Use \"\" for blank custom mapYou can use Online Map Editor (a community tool) to create, edit and export maps.","other-common-options#Other common options":"Most of the options are inherited from the usual custom games. A few more options have been added, specifically for modding (top of the list):\nOption\tExpected data type\tDescription\tDefault value (if omitted)\troot_mode\tstring\tThe mode to inherit from: \"survival\", \"team\", \"invasion\", \"deathmatch\", \"battleroyale\" or unspecified (other values)\tunspecified\treset_tree\tboolean\tSet to true to remove the original ship tree\tfalse\tships\tarray<string>\tAn array of ships to add to the tree\tNone\tmap_size\tinteger\tSize of the map, range from 20 to 200, even value only\t100 (survival), 80 (team and Battle Royale), 60 (unspecified), 30 (Invasion), 20 (deathmatch)\tsoundtrack\tstring\t\"procedurality.mp3\", \"argon.mp3\", \"crystals.mp3\", \"red_mist.mp3\", \"civilisation.mp3\", \"warp_drive.mp3\" or none (other values)\t\"crystals.mp3\" (invasion and Battle Royale), \"argon.mp3\" (deathmatch), \"procedurality.mp3\" (others)\tmax_players\tinteger\tPlayers limit of the game, from 1 to 240\t70 (team), 60 (survival), 40 (unspecified), 30 (Battle Royale), 20 (deathmatch), 6 (invasion)\tcrystal_value\tfloat\tCrystal multiplier applied to crystals dropping from destroyed asteroids, from 0 to 10\t2 (team), 0 (deathmatch and Battle Royale), 1 (others)\tlives\tinteger\tNumber of lives, from 1 to 5\t4 (team), 1 (deathmatch and Battle Royale), 3 (others)\tmaxtierlives\tinteger\tNumber of lives (from 1 to 5) when player reaches ships with the highest level (defined in max_level option)\t0 (team and deathmatch), 1 (Battle Royale), 3 (others)\tmax_level\tinteger\tMax level you can reach, from 1 to 7\t7\tfriendly_colors\tinteger\tServes to define teams; how many teams (or 0, maximum 5)\t3 (team), 1 (invasion), 0 (others)\tmap_name\tstring\tName of the map\tAuto-generated name\tsurvival_level\tinteger\tLevel which triggers survival mode (8 for no trigger, 2 minimum)\t7 (survival), 8 (others)\tstarting_ship\tinteger\tEnter desired ship code: 101, 201, 404, etc.\t101\tstarting_ship_maxed\tboolean\tStarting ship is maxed\tfalse\tasteroids_strength\tfloat\tThe strength of the asteroids compared to their normal states, 0 to 1000000\t5 (deathmatch), 0.5 (Battle Royale), 1 (others)\tfriction_ratio\tfloat\tFriction ratio of the game (0 to 2)\t1\tstrafe\tfloat\tStrafing speed factor, from 0 to 1\t0\tspeed_mod\tfloat\tSpeed of the mod, from 0 to 2\t1.25 (deathmatch), 1.2 (survival and team), 1 (others)\trcs_toggle\tboolean\tEnable RCS feature for ships\ttrue\tmap_id\tinteger\tSeed (ID) of the auto-generated map, from 0 to 9999\tGame ID\tmap_density\tfloat\tDensity of the map, from 0 to 2\tNone\tweapon_drop\tfloat\tProbability that an asteroid will drop a weapon, from 0 to 10\t0\tcrystal_drop\tfloat\tPercentage of gems that can be collected when a ship drains gems, from 0 to 1\t0.5 (deathmatch), 1 (others)\trelease_crystal\tboolean\tAllow [V] to release gems\ttrue (team), false (others)\tmines_self_destroy\tboolean\tMines will self-destruct after a while\ttrue\tmines_destroy_delay\tinteger\tAll landed mines will be destroyed after this interval if no enemies trigger them (in ticks). Minimum 0, no actual maximum limit\t3600 (Battle Royale), 18000 (others)\thealing_enabled\tboolean\tEnable healing feature\ttrue (team), false (others)\thealing_ratio\tfloat\tHealing ratio to actual laser damage, from 0 to 2\t0.5 (team), 1 (others)\tshield_regen_factor\tfloat\tShield regeneration multiplier to natural regeneration of ships. Minimum 0, no actual maximum limit\t1\tpower_regen_factor\tfloat\tPower (Energy) regeneration multiplier to natural regeneration of ships. Minimum 0, no actual maximum limit\t1\tinvulnerable_ships\tboolean\tShips are invulnerable\tfalse\tweapons_store\tboolean\tAllow access to the weapon store\ttrue\tradar_zoom\tfloat\tRadar zoom ratio. Set value to 1, 2, or 4 (recommended values are powers of 2)\t2\tauto_refill\tboolean\tCollecting an energy or shield pill immediately refills energy or shield. Otherwise, the collected pill is added to the active weapons\tfalse\tprojectile_speed\tfloat\tAffects the speed of rockets, missiles, and torpedoes. Use 1 for default speed. Minimum 0, no actual maximum limit\t1\tchoose_ship\tarray<integer>\te.g., setting to [301,302,303] will let player choose a ship from these 3 ships before entering the game\tNone\tcollider\tboolean\tEnable collisions of player ships with anything\ttrue","survival-mode-specific-options#Survival mode specific options":"Option\tExpected data type\tDescription\tDefault value (if omitted)\tsurvival_time\tfloat\tWhen to trigger survival mode (in minutes): 0 to disable survival time trigger from 1 to 600 to set the survival trigger time\t60\tbouncing_lasers\tfloat\tMust be a value between 0 (no bounce) or 1 (bounce retains 100% of the laser damage) Note: This feature is planned to be applied to all root modes in the future\t0.9","team-mode-specific-options#Team mode specific options":"Option\tExpected data type\tDescription\tDefault value (if omitted)\thues\tarray<integer>\tHue numbers for teams, with the same amount of elements as used for friendly_colors\tAuto-generated hues\tstation_regeneration\tfloat\tFactor to apply to station shield regen, from 0 to 2\t1\tstation_size\tinteger\tSize of the stations; integer from 1 to 5\t2\tstation_crystal_capacity\tfloat\tFactor to apply to the station crystal capacity, from 0.1 to 10\t1\tstation_repair_threshold\tfloat\tPart of the station crystal capacity that must be refilled to repair a module, from 0 to 1\t0.25\tauto_assign_teams\tboolean\tAllow assigning players to a specific team, otherwise let them choose the team themselves\tfalse\tall_ships_can_dock\tboolean\tAllow ships of Tier higher than base station normally lets in, to enter depots\tfalse\tall_ships_can_respawn\tboolean\tAllow ships of Tier higher than base station normally lets in, to respawn from spawn ports, otherwise randomly on map\tfalse","deathmatch-mode-specific-options#Deathmatch mode specific options":"Option\tExpected data type\tDescription\tDefault value (if omitted)\tship_groups\tarray<string>\tAn array containing some arrays, each of them representing one ship group (by name) available for selection. See the example below. The longer the array is, the lower chance for each ship group being available in a single match\tSee [[Deathmatch]] for a list of default ship groups. The mod won't run if reset_tree option is set to true without manually specifying the ship groups. Please note that the ship groups will be automatically set to only U-Sniper if map_name is set to \"Battle of Titans\". Please [[Easter Eggs#Battle of Titans\tsee here]] for more information.\t\nExample:\nship_groups: [\r\n  [\"U-Sniper\",\"Howler\"],\r\n  [\"Crusader\",\"Pioneer\"]\r\n]","ticking#Ticking":""}},"/docs/First_Mod":{"title":"Creating your first mod","data":{"":"In the Mod Code window, type the code for your first mod:\nthis.options = {\n  root_mode: \"survival\",\n  map_size: 30\n};\nthis.tick = function(game) {\n};\nIn newer versions of browsers' updates, you can't use the Modding Client in incognito mode anymore as they restrict some incognito features which are used by the editor.\nAnd make sure to read all of these from the start to the end so that you won't miss any important info!"}},"/docs/Main_Code_Parts/Aliens":{"title":"Aliens","data":{"aliens#Aliens":"You can access the list of aliens through the array game.aliensYou can also find an alien with a specific id using game.findAlien(id), which returns an object representing the matched alien or null (if no aliens are matching the provided id)","creation#Creation":"To create an alien, use game.addAlien({ options })List of accepted options:(Note: Server will respond with Incorrect data when at least one input property value is improper)\nOption\tDescription\tDefault value (if omitted)\tx\tX coordinate\t0\ty\tY coordinate\t0\tvx\tVelocity vector X component\t0\tvy\tVelocity vector Y component\t0\tcode\tType of alien must be an integer in range [10-20]\t10\tlevel\tLevel of the alien, in range [0-X] where X depends on the alien type\t0\tpoints\tThe number of points you earn when you kill this alien\tNone\tcrystal_drop\tThe crystal amount to be dropped when this alien is killed\tNone\tweapon_drop\tThe code of a collectible weapon to be dropped by this alien when killed\tNone\t\nHere is the list of supported codes:\nCode\tAlien name\t10\tChicken\t11\tCrab\t12\tFortress\t13\tCaterpillar\t14\tCandlestick\t15\tHirsute\t16\tPiranha\t17\tPointu\t18\tFork\t19\tSaucer\t20\tFinal Boss\t\nA new Alien object is immediately added to game.aliens; however, it cannot be used before it has been assigned an id (natural number, a.k.a non-negative integer) by the server.","limits#Limits":"You can only have 300 alive aliens (including aliens generated by the game mode) at any time in your gameThe server will respond with Too many aliens for each alien passing the limit","accessible-fields#Accessible fields":"For each alien object in game.aliens, You have access to the same properties as the available ones when you add aliens, plus some additional properties:\nOption\tDescription\tgame\tPoints to the global game object\tid\ta unique identifier for the alien","configuration#Configuration":"Once an alien is live and has an assigned id, you can set options to it. For example:\n> game.aliens[0].set({x:0,y:0});\n> █\nWill move the first alien in the list to the center of the mapAccepted options when using alien.set:\nOption\tDescription\tServer response error message (if improper)\tx\tX coordinate\tWrong coordinate\ty\tY coordinate\tWrong coordinate\tvx\tVelocity vector X component\tWrong coordinate\tvy\tVelocity vector Y component\tWrong coordinate\tshield\tShield\tWrong shield value\tregen\tShield regen\tWrong regen value\tdamage\tLaser damage\tWrong damage value\tlaser_speed\tLaser speed\tWrong damage value\trate\tFiring rate\tWrong rate value\tkill\tSet kill: (any \"truthy\" value, e.g: true) to destroy the alien\tNo violation"}},"/docs/Main_Code_Parts/Asteroids":{"title":"Asteroids","data":{"asteroids#Asteroids":"You can access the list of moving asteroids through the array game.asteroidsYou can also find an asteroid with a specific id using game.findAsteroid(id), which returns an object represents the matched asteroid or null (if no asteroids are matching the provided id)","creation#Creation":"To create an asteroid, use game.addAsteroid({ options }).Here is the list of accepted options:(Note: Server will respond with Incorrect data when at least one input property value is improper)\nOption\tDescription\tDefault value (if omitted)\tx\tX coordinate\t0\ty\tY coordinate\t0\tvx\tVelocity vector X component\t0\tvy\tVelocity vector Y component\t0\tsize\tSize of the asteroid in the range [1-100]\t30\t\nA new Asteroid object is immediately added to game.asteroids ; however, it cannot be used before it has been assigned an id (natural number, a.k.a non-negative integer) by the server.","limits#Limits":"You can only have 300 alive asteroids (including moving asteroids generated by the game mode) at any time in your gameThe server will respond with Too many asteroids for each asteroid passing the limit","accessible-fields#Accessible fields":"For each asteroid object in game.asteroids, You have access to the same properties as the available ones when you add asteroids, plus some additional properties:\nOption\tDescription\tgame\tPoints to the global game object\tid\ta unique identifier for the asteroid","configuration#Configuration":"Once an asteroid is live and has an assigned id, you can set options to it. For example:\n> game.asteroids[0].set({x:0,y:0});\n> █\nWill move the first asteroid in the list to the center of the mapList of accepted options when using asteroid.set:\nOption\tDescription\tServer response error message (if improper)\tx\tX coordinate\tWrong coordinate\ty\tY coordinate\tWrong coordinate\tvx\tVelocity vector X component\tWrong coordinate\tvy\tVelocity vector Y component\tWrong coordinate\tsize\tAsteroid size in the range [1-100] (note that changing asteroid size resets its life points)\tIncorrect size\tkill\tSet kill: (any \"truthy\" value, e.g: true) to destroy the asteroid\tNo violation"}},"/docs/Main_Code_Parts/Collectibles":{"title":"Collectibles","data":{"collectibles#Collectibles":"You can spawn collectible weapons in the playfieldYou can also find a collectible with a specific id using game.findCollectible(id), which returns an object represents the matched collectible or null (if no collectibles are matching the provided id)","creation#Creation":"Here is an example:\n> game.addCollectible({code:10,x:0,y:0});\n> █\nThis will add a new collectible pack of rockets to coordinates (0;0)Here is the list of supported codes:(Note: Server will respond with Incorrect data when at least one input property value is improper)\nCode\tDescription\t10\t4 rockets pack\t11\t2 missiles pack\t12\t1 torpedo\t20\t8 light mines pack\t21\t4 heavy mines pack\t40\tMining pod\t41\tAttack pod\t42\tDefense pod\t90\tEnergy refill\t91\tShield refill","limits#Limits":"You can only have 50 active collectibles (including collectibles generated by the game mode) at any time in your gameThe server will respond with Too many Collectibles for each collectible passing the limit","accessing#Accessing":"For each collectible object in game.collectibles, You have access to the same properties as the available ones when you add collectibles, plus some additional properties:\nOption\tDescription\tgame\tPoints to the global game object\tid\ta unique identifier for the collectible"}},"/docs/Main_Code_Parts/Map":{"title":"Map","data":{"definition#Definition":"All entities and objects in the game are moving on a 2D plane called \"map\"Map can be painted with asteroids using this.options.custom_map and set size by this.options.map_size (even value from 20 to 200)All Modding commands relating to coordinates will be visualized on this map","coordinates#Coordinates":"","axes#Axes":"Axis\tDirection in user screen\tX\tleft to right\tY\tbottom to top\tZ\tmap \"depth\", only used for setting 3D Objects","grid#Grid":"The map is divided into \"grids\".A Grid is a 10x10 square area which can only contain 1 static asteroid (which equals to 1 character to \"paint\" the map in this.options.custom_map)map_size is the number of grids along each dimension, which means that the number of grids in the map is calculated by the formula map_size2.For example: map_size being 30 means that there are 30 grid length along the X Axis and Y Axis, and 302 = 900 grids total in the map","center-and-boundaries#Center and Boundaries":"Map center (x:0, y:0) is located in the SunBased on the Grid definition, we have:Each Axis will have map_size / 2 grids length in both negative and positive partBecause each grid is a 10x10 square, the boundary of each part is map_size / 2 x 10 = map_size x 5Means that each Axis varies from -map_size x 5 to map_size x 5For example: with map_size = 30, each Axis in the map varies from -300 (-60x5) to 300 (60x5)"}},"/docs/Main_Code_Parts/Options":{"title":"Options","data":{"options#Options":"","definition#Definition":"Stored in this.options is a data structure where you can set options for your custom modded game. These options are used for initializing the game when you start your mod. Changing them while the mod is running does not affect the game.","custom-ships-and-custom-tree#Custom ships and custom tree":"You can import ships made within the Starblast Ship Editor. Use \"Mod Export\" feature to export a JavaScript code snippet for the modding interface. Then paste this snipped in the coding window and add this:\nvar myship_101 = \"{ … … <this is your exported ship code> …\";\nvar ships = [myship_101]; // add your ship to an array of ship\nthis.options = {\n  root_mode: \"survival\",\n  ships: ships,         // specifying a list of ships to complement / replace existing ships\n  reset_tree: true,     // set to true if you want to remove the original ship tree, false if you just want to replace some of the ships\n  map_size: 30\n};\nthis.tick = function(game) {\n};\nThen run your mod. If your ship is set to level=1 model=1, your ship will replace the Fly. You can replace other ships in the tree in a similar way, using reset_tree: false. Or you can remove the original ship tree completely and provide a whole new one using reset_tree: true.","customizing-the-emote-chat-system#Customizing the emote-chat system":"The vocabulary used for the emote-chat system can be customized by setting the field vocabulary in the game option as follows:\nvar vocabulary = [\n  { text: \"Hello\", icon: \"\\u0045\", key: \"O\" },\n  { text: \"Bye\", icon: \"\\u0046\", key: \"B\" },\n  { text: \"Yes\", icon: \"\\u004c\", key: \"Y\" },\n  { text: \"No\", icon: \"\\u004d\", key: \"N\" },\n  { text: \"Flower\", icon: \"\\u{1F33B}\", key: \"F\" },\n  { text: \"Snowman\", icon: \"\\u26c4\", key: \"M\" },\n  { text: \"Shark\", icon: \"\\u{1F988}\", key: \"S\" },\n  { text: \"Ghost\", icon: \"\\u{1F47B}\", key: \"G\" }\n];\nthis.options = {\n  vocabulary: vocabulary,\n  // ...\n};\nThis allows using Starblast built-in emote icons, which are listed here for reference: https://starblast.io/glyphs.htmlYou can also use unicode icons, here is a good source for reference: https://unicode.org/emoji/charts/full-emoji-list.htmlNote that wide unicode characters (using more than 2 bytes) requires a specific Javascript syntax as shown in the example above (example: \\u{1F47B})","custom-asteroids-maps#Custom asteroids maps":"You can create a custom map of asteroids. This allows creating a maze for example. The custom map you provide is actually a JavaScript character string that is used to \"paint\" the map.For example:\nvar map =\n\"999999999999999999999999999999\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"99                          99\\n\"+\n\"999999999999999999999999999999\" ;\nthis.options = {\n  custom_map: map,\n  map_size: 30\n}\nIn the example above, 9 sets the biggest size of the asteroid. You can use smaller values for adding smaller asteroids to the grid. Any value other than a digit will be interpreted as no asteroid. If your map_size is set to 30, make sure to create 30 lines and 30 columns, or you may get unpredictable results.Note: Use \"\" for blank custom mapYou can use Online Map Editor (a community tool) to create, edit and export maps.","other-common-options#Other common options":"Most of the options are inherited from the usual custom games. A few more options have been added, specifically for modding (top of the list):\nOption\tExpected data type\tDescription\tDefault value (if omitted)\troot_mode\tstring\tThe mode to inherit from: \"survival\", \"team\", \"invasion\", \"deathmatch\", \"battleroyale\" or unspecified (other values)\tunspecified\treset_tree\tboolean\tSet to true to remove the original ship tree\tfalse\tships\tarray<string>\tAn array of ships to add to the tree\tNone\tmap_size\tinteger\tSize of the map, range from 20 to 200, even value only\t100 (survival), 80 (team and Battle Royale), 60 (unspecified), 30 (Invasion), 20 (deathmatch)\tsoundtrack\tstring\t\"procedurality.mp3\", \"argon.mp3\", \"crystals.mp3\", \"red_mist.mp3\", \"civilisation.mp3\", \"warp_drive.mp3\" or none (other values)\t\"crystals.mp3\" (invasion and Battle Royale), \"argon.mp3\" (deathmatch), \"procedurality.mp3\" (others)\tmax_players\tinteger\tPlayers limit of the game, from 1 to 240\t70 (team), 60 (survival), 40 (unspecified), 30 (Battle Royale), 20 (deathmatch), 6 (invasion)\tcrystal_value\tfloat\tCrystal multiplier applied to crystals dropping from destroyed asteroids, from 0 to 10\t2 (team), 0 (deathmatch and Battle Royale), 1 (others)\tlives\tinteger\tNumber of lives, from 1 to 5\t4 (team), 1 (deathmatch and Battle Royale), 3 (others)\tmaxtierlives\tinteger\tNumber of lives (from 1 to 5) when player reaches ships with the highest level (defined in max_level option)\t0 (team and deathmatch), 1 (Battle Royale), 3 (others)\tmax_level\tinteger\tMax level you can reach, from 1 to 7\t7\tfriendly_colors\tinteger\tServes to define teams; how many teams (or 0, maximum 5)\t3 (team), 1 (invasion), 0 (others)\tmap_name\tstring\tName of the map\tAuto-generated name\tsurvival_level\tinteger\tLevel which triggers survival mode (8 for no trigger, 2 minimum)\t7 (survival), 8 (others)\tstarting_ship\tinteger\tEnter desired ship code: 101, 201, 404, etc.\t101\tstarting_ship_maxed\tboolean\tStarting ship is maxed\tfalse\tasteroids_strength\tfloat\tThe strength of the asteroids compared to their normal states, 0 to 1000000\t5 (deathmatch), 0.5 (Battle Royale), 1 (others)\tfriction_ratio\tfloat\tFriction ratio of the game (0 to 2)\t1\tstrafe\tfloat\tStrafing speed factor, from 0 to 1\t0\tspeed_mod\tfloat\tSpeed of the mod, from 0 to 2\t1.25 (deathmatch), 1.2 (survival and team), 1 (others)\trcs_toggle\tboolean\tEnable RCS feature for ships\ttrue\tmap_id\tinteger\tSeed (ID) of the auto-generated map, from 0 to 9999\tGame ID\tmap_density\tfloat\tDensity of the map, from 0 to 2\tNone\tweapon_drop\tfloat\tProbability that an asteroid will drop a weapon, from 0 to 10\t0\tcrystal_drop\tfloat\tPercentage of gems that can be collected when a ship drains gems, from 0 to 1\t0.5 (deathmatch), 1 (others)\trelease_crystal\tboolean\tAllow [V] to release gems\ttrue (team), false (others)\tmines_self_destroy\tboolean\tMines will self-destruct after a while\ttrue\tmines_destroy_delay\tinteger\tAll landed mines will be destroyed after this interval if no enemies trigger them (in ticks). Minimum 0, no actual maximum limit\t3600 (Battle Royale), 18000 (others)\thealing_enabled\tboolean\tEnable healing feature\ttrue (team), false (others)\thealing_ratio\tfloat\tHealing ratio to actual laser damage, from 0 to 2\t0.5 (team), 1 (others)\tshield_regen_factor\tfloat\tShield regeneration multiplier to natural regeneration of ships. Minimum 0, no actual maximum limit\t1\tpower_regen_factor\tfloat\tPower (Energy) regeneration multiplier to natural regeneration of ships. Minimum 0, no actual maximum limit\t1\tinvulnerable_ships\tboolean\tShips are invulnerable\tfalse\tweapons_store\tboolean\tAllow access to the weapon store\ttrue\tradar_zoom\tfloat\tRadar zoom ratio. Set value to 1, 2, or 4 (recommended values are powers of 2)\t2\tauto_refill\tboolean\tCollecting an energy or shield pill immediately refills energy or shield. Otherwise, the collected pill is added to the active weapons\tfalse\tprojectile_speed\tfloat\tAffects the speed of rockets, missiles, and torpedoes. Use 1 for default speed. Minimum 0, no actual maximum limit\t1\tchoose_ship\tarray<integer>\te.g., setting to [301,302,303] will let player choose a ship from these 3 ships before entering the game\tNone\tcollider\tboolean\tEnable collisions of player ships with anything\ttrue","survival-mode-specific-options#Survival mode specific options":"Option\tExpected data type\tDescription\tDefault value (if omitted)\tsurvival_time\tfloat\tWhen to trigger survival mode (in minutes): 0 to disable survival time trigger from 1 to 600 to set the survival trigger time\t60\tbouncing_lasers\tfloat\tMust be a value between 0 (no bounce) or 1 (bounce retains 100% of the laser damage) Note: This feature is planned to be applied to all root modes in the future\t0.9","team-mode-specific-options#Team mode specific options":"Option\tExpected data type\tDescription\tDefault value (if omitted)\thues\tarray<integer>\tHue numbers for teams, with the same amount of elements as used for friendly_colors\tAuto-generated hues\tstation_regeneration\tfloat\tFactor to apply to station shield regen, from 0 to 2\t1\tstation_size\tinteger\tSize of the stations; integer from 1 to 5\t2\tstation_crystal_capacity\tfloat\tFactor to apply to the station crystal capacity, from 0.1 to 10\t1\tstation_repair_threshold\tfloat\tPart of the station crystal capacity that must be refilled to repair a module, from 0 to 1\t0.25\tauto_assign_teams\tboolean\tAllow assigning players to a specific team, otherwise let them choose the team themselves\tfalse\tall_ships_can_dock\tboolean\tAllow ships of Tier higher than base station normally lets in, to enter depots\tfalse\tall_ships_can_respawn\tboolean\tAllow ships of Tier higher than base station normally lets in, to respawn from spawn ports, otherwise randomly on map\tfalse","deathmatch-mode-specific-options#Deathmatch mode specific options":"Option\tExpected data type\tDescription\tDefault value (if omitted)\tship_groups\tarray<string>\tAn array containing some arrays, each of them representing one ship group (by name) available for selection. See the example below. The longer the array is, the lower chance for each ship group being available in a single match\tSee [[Deathmatch]] for a list of default ship groups. The mod won't run if reset_tree option is set to true without manually specifying the ship groups. Please note that the ship groups will be automatically set to only U-Sniper if map_name is set to \"Battle of Titans\". Please [[Easter Eggs#Battle of Titans\tsee here]] for more information.\t\nExample:\nship_groups: [\n  [\"U-Sniper\",\"Howler\"],\n  [\"Crusader\",\"Pioneer\"]\n]"}},"/docs/Main_Code_Parts/Objects":{"title":"Objects","data":{"add-3d-objects-to-the-scenery#Add 3D objects to the scenery":"The mod can create custom, textured 3D objects and add them to the scenery using game.setObject method.* A dimensional property included in this method is defined as an object with three fields represent 3 Axes in Coordinates\nField\tRepresent for\tx\tX Axis\ty\tY Axis\tz\tZ Axis","object-instance-options#Object instance options":"Option\tDescription\tid\ta unique identifier for this object instance (mandatory, allows changing the object afterwards)\ttype\tthe object type definition\tposition\tcoordinates for placing the object, dimensional property\tscale\tallows scaling the object, dimensional property\trotation\tallows rotating the object, dimensional property","object-type-options#Object type options":"Option\tDescription\tDefault value\tid\ta unique identifier for this object type, mandatory\t\"undefined\" or \"null\" depending on implementation\tobj\ta URL to the OBJ file\tNone\tdiffuse\ta URL to a diffuse texture file (optional)\tNone\temissive\ta URL to an emissive texture file (optional)\tNone\tspecular\ta URL to a specularity texture file (optional)\tNone\tbump\ta URL to a bump texture map (optional)\tNone\temissiveColor\temissive color of the object, e.g. 0xFF0000 (for red)\tWhite if emissive is valid, Black otherwise\tdiffuseColor\tdiffuse color of the object, e.g. 0x00FF00 (for green)\tWhite if diffuse is valid, Black otherwise\tspecularColor\tspecular color of the object, e.g. 0x0000FF (for blue)\tWhite if specular is valid, Black otherwise\ttransparent\twhether the object's texture has transparency or not\ttrue\tbumpScale\tscale for bump mapping\t0.1\tshininess\tthe shininess of the specular map\t30\tphysics\tObject's physics\tNone\t\nAll URLs included as property value must satisfy one of these conditions:\nIt's a Data URL (data: protocol)\nThe protocol must be https (explicitly, not omitted) and the domain only matches one of these:\nstarblast.io (Official Starblast)\nstarblast.data.neuronality.com (Neuronality's Starblast Data)\ngithub.com (GitHub)\nraw.githubusercontent.com (Raw GitHub Content)\ngitlab.com (GitLab)\nIf any URL-required fields mentioned above are present but don't satisfy these conditions, the whole object is rejected to be set on the players' clients.Please note that GitHub and GitLab URLs can be easily converted into raw data URLs (such as changing /blob/ into /raw/ or appending ?raw=true at the end for GitHub URLs exclusively). Any URL using GitHub or GitLab domain should point to the raw file content and not the webpage version of the file itself.","object-physics-options#Object physics options":"Note: We recommend not to use this property as it usually doesn't work as expected\nOption\tDescription\tmass\tObject mass, same as the specs.ship.mass property in Ship Editor Tutorial Note: If the mass is too small (<100), ships can go through the object\tshape\tObject's shape, used for creating hitbox You can omit this property to set default shape generated from the object itself or provide an array for your custom shape\t\nFor example:\nvar cube = {\n  id: \"cube\",\n  obj: \"https://raw.githubusercontent.com/pmgl/starblast-modding/master/objects/cube/cube.obj\",\n  diffuse: \"https://raw.githubusercontent.com/pmgl/starblast-modding/master/objects/cube/diffuse.jpg\"\n} ;\ngame.setObject({\n  id: \"cube\",\n  type: cube,\n  position: {x:0,y:0,z:0},\n  rotation: {x:0,y:0,z:0},\n  scale: {x:1,y:1,z:1}\n}) ;","accessing#Accessing":"Game property game.objects stores all active 3D Objects maintained by the modYou shouldn't modify this property to keep the mod running smoothly","changing-or-moving-an-object#Changing or moving an object":"Use game.setObject again with the same object instance ID.Note: Object type's properties can not be changed once set. You may need to define a new object type instance with different ID and set the object you wish to update with the new object type ID.","removing-an-object#Removing an object":"game.removeObject(id) removes the object with given id. You can omit the id parameter, which will remove all custom objects in the scene.","example#Example":"Working example, adding cube objects to the scenery: https://github.com/pmgl/starblast-modding/blob/master/examples/adding_cube.js"}},"/docs/Main_Code_Parts/Problems":{"title":"Problems","data":{"common-problems-and-how-to-fix-them#Common problems and how to fix them":"","black-screen-issue#Black screen issue":"In most cases, you're getting a black screen after loading your mod due to a bad ship tree.Follow these rules to avoid it:\nYour ship tree must have a ship with type/code 101.\nIf your ship tree has level 2 ships, then it should have level 1 ships too.\nEither models should go in the right order without gaps: 1, 2, 3 etc (not 1, 6, 17) or control all ship tree routes by next parameter in ship codes (but keep correct order for unreachable ships).\nYou can't have possibly infinite ship tree routes, made by next parameters - all routes should end at some ship, there shouldn't be able to come back to some ship again.","my-mod-closed-accidentally-but-the-game-is-not-stopped#My mod closed accidentally but the game is not stopped":"Sometimes, some unexpected problems can crash the mod, but it only disconnects from the modding side, or so-called \"controller\" side, the game itself will continue running without control from your modding client until it meets the closing requirements (or even in some serious occasions, game developers - like PMGL - need to close it by themselves).Here are some reasons which can lead to mod crashing:\nClosing/Reloading the modding tab/window without stopping the mod first (Most common one)\nVery unstable internet connection\nServer resolve error (which will automatically disconnect the controller by itself)\nBrowser tab hangs/crashes (careful of infinite while/for loops)\nAlso keep in mind that you can't reconnect to your previously crashed server, even if it's still running."}},"/docs/Main_Code_Parts/Others_Instances":{"title":"Others Instances","data":{"other-game-instances-and-methods#Other game instances and methods":"","set-custom-maps-in-game#Set custom maps in-game":"You can use game.setCustomMap(<map pattern>) to set custom map while the game is runningwhere <map pattern> has the same format as the custom map in this.options","lockunlock-the-mod-from-attracting-new-players#Lock/unlock the mod from attracting new players":"Use game.setOpen(true/false) to lock/unlock the mod to be visible to players (only for Modding Space mods)There is also game boolean properties game.is_open is used to determine if the mod is open or not."}},"/docs/Main_Code_Parts/Ship":{"title":"Ship","data":{"ships#Ships":"You can access the list of ships (players) through the array game.shipsYou can also find a ship with a specific id using game.findShip(id), which returns an object representing the matched ship or null (if no ships are matching the provided id)","accessible-fields#Accessible fields":"You have read access to the ship’s main fields and options:\nField\tDescription\tid\tA unique identifier for the ship\tgame\tPoints to the global game object\tx\tX coordinate\ty\tY coordinate\tvx\tVelocity vector X component\tvy\tVelocity vector Y component\tr\tRotation angle of the ship (in radian)\tname\tplayer's name\talive\tWhether the ship is alive or destroyed\ttype\tShip type code (e.g. 101)\tstats\tShip current stats upgrades, compiled into a single integer. For example: 10012301 means the 8 stats upgrade levels are 1,0,0,1,2,3,0 and 1\tidle\ttells if the ship is in idle status or not\tteam\tthe id of the team this ship is in\tscore\tplayer's score\tshield\tcurrent shield value\tgenerator\tcurrent generator value\tcrystals\tcurrent crystals value\thealing\twhether the ship's lasers are in healing mode or not","configuration#Configuration":"You can set different options on the ships. For example:\n> game.ships[0].set({x:0,y:0});\n> █\nWill move the first ship in the list to the center of the mapList of accepted options when using ship.set:\nOption\tDescription\tServer response error message (if improper)\tx\tX coordinate\tWrong coordinate\ty\tY coordinate\tWrong coordinate\tvx\tVelocity vector X component\tWrong coordinate\tvy\tVelocity vector Y component\tWrong coordinate\tinvulnerable\tUse to set the ship invulnerable for X ticks (e.g. 60 for one second invulnerability)\tWrong invulnerable time\ttype\tchanges the type of ship (use the ship code, e.g. {type:403} )\tNone\tangle\tchanges the direction the ship is facing\tWrong angle\tscore\tsets player's score\tWrong score\tidle\tset to true to force the ship to stay idle (and false to revert)\tNone\tshield\tsets the value of the shield\tWrong shield value\tgenerator\tsets the value of the generator\tWrong generator value\thealing\tsets ship's lasers mode to healing (true or false)\tNone\tcrystals\tsets ship's crystal amount\tWrong crystals\tstats\tset the stats upgrades of the ship\tNone\tkill\tSet kill: (any \"truthy\" value, e.g: true) to destroy the ship\tNo violation\tteam\tChanges the team this ship belongs to (in range [0-X] where X is teams - 1)\tNone\tcollider\tChange the ship's collider (the ship can interact with other objects in-game or not), must be true or false\tNone\thue\tSets the colour of the ship (range [0-359])\tNone","intermission#Intermission":"You can send the ship to intermission (a screen with results, offering to respawn). This screen allows you to display custom results information:\n> game.ships[0].intermission({\"Best Achievement\":\"Managed to run the mod\",\"Score\":1234});\n> █","triggering-and-customizing-players-gameover-screen#Triggering and Customizing player's GameOver screen":"You can also trigger the gameover screen for any given ship. Here again, you can pass results information to pass on to the player:\n> game.ships[0].gameover({\"Rating\":\"Can do better\",\"Score\":1234});\n> █","instructor#Instructor":"","calling-instructor#Calling instructor":"You can have the flight instructor send instructions to the player. For this find the player's ship and use:\n> ship.instructorSays(\"Hello!\")\n> █\nYou can hide the instructor window using:\n> ship.hideInstructor()\n> █\nYou can later show it again using:\n> ship.showInstructor()\n> █\nA second, optional parameter allows you to choose which one of the instructor characters will talk to the player. Example:\n> ship.instructorSays(\"Here is your report, Commander\",\"Maria\")\n> █","available-characters#Available characters":"Lucina\tKlaus\tMaria\tKan\tZoltar","custom-ui-components#Custom UI components":"","general#General":"The mod can create custom UI components that will show up on the player’s screen. This is done by calling setUIComponent on the ship - passing in a component descriptor.For example:\n> ship.setUIComponent({\n    id:\"myid\",\n    position:[0,0,25,25],\n    clickable: true,\n    shortcut: \"X\",\n    visible: true,\n    components: [\n      { type:\"box\",position:[0,0,100,100],fill:\"#456\",stroke:\"#CDE\",width:2},\n      { type: \"text\",position: [0,0,100,50],color: \"#FFF\",value: \"My Text\"},\n      { type: \"player\",id: 1, position: [0,0,50,50],color: \"#FFF\"},\n    ]\n  })\n> █\nHere is the list of UIComponent's accepted options:\nOption\tDescription\tDefault value (if omitted)\tid\ta unique identifier for this component, mandatory\tNone (component won't be set)\tposition\texpressed in percentage of the main screen, the position of the component [x,y,width,height]. Example: [45,45,10,10] creates a component in the center of the screen, in which width and height are 10% of the screen width and height.\tClient-based positions (\"radar_background\" and \"scoreboard\" id, see this section) [0,0,100,100] (others)\tvisible\tWhether the component is visible or not. Resend the same data with visible set to false to hide the component\ttrue\tclickable\tWhether this component can be clicked or not\tfalse\tshortcut\tWhen the component is clickable, a keyboard shortcut allowing to trigger the click event\tNone (no shortcuts)\tcomponents\tgives a list (array) of graphical features to render within the component, which will be described below\tEmpty array ([])","subcomponents-accepted-options#Subcomponents' accepted options":"Option\tDescription\tDefault value (if omitted)\ttype\ttype of the subcomponent currently supported: \"round\", \"text\", \"box\" or \"player\"\tNone (subcomponent won't be rendered)\tid (\"player\" type only)\tid of the player associated with the subcomponent, which will be disapleyd as their name and badge (if exists) in the rendered subcomponent\tNone (blank player info)\tposition\tpositions of the subcomponent, formatted as [x,y,width,height] that subcomponent are meant within the main component coordinates\tNone (subcomponent won't be rendered)\tvalue (\"text\" type only)\tvalue of the text subcomponent, e.g value:\"Sample text\"\tEmpty string (\"\")\tcolor\ttext color of the subcomponent, this can be a string with any color formats (hex, hsla, rgb, etc.), e.g \"#fff\"\tBlack (with opacity 1)\tfill\tbackground color of the subcomponent, same format as the color property\tBlack (with opacity 0)\twidth\twidth of the subcomponent's border One unit of this value equals (1 / (End user screen's pixel density)) CSS pixels (px)\t0\tstroke\tborder color of the subcomponent, same format as the color property\tBlack (with opacity 0)\talign\talignment of the texts inside the subcomponent \"left\", \"right\" or \"center\" only\t\"center\"","combining-with-events#Combining with events":"The example below creates a warp button for every player, which can be clicked and results in the ship warping to another random location, adding 3 seconds invulnerability to it:Full example: https://github.com/pmgl/starblast-modding/blob/master/examples/warp_button.js\nvar warp_button = {\n  id: \"warp\",\n  position: [2,50,8,14],\n  clickable: true,\n  shortcut: \"W\",\n  visible: true,\n  components: [\n    { type:\"round\",position:[0,0,100,100],fill:\"#456\",stroke:\"#CDE\",width:2},\n    { type: \"text\",position:[10,35,80,30],value:\"WARP\",color:\"#CDE\"},\n    { type: \"text\",position:[20,70,60,20],value:\"[W]\",color:\"#CDE\"}\n    ]\n};\nvar warpShip = function(ship) {\n  x = (Math.random()-.5) * ship.game.options.map_size*10 ;\n  y = (Math.random()-.5) * ship.game.options.map_size*10 ;\n  ship.set({x:x,y:y,vx:0,vy:0,invulnerable:180}) ;\n} ;\nthis.tick = function(game) {\n  if (game.step%60==0) // ensure this is done only once per second\n  {\n    for (var i=0;i<game.ships.length;i++)\n    {\n      var ship = game.ships[i] ;\n      if (!ship.custom.warp_button_installed)\n      {\n        ship.custom.warp_button_installed = true;\n        ship.setUIComponent(warp_button);\n      }\n    }\n  }\n} ;\nthis.event = function(event,game) {\n  switch (event.name)\n  {\n    case \"ui_component_clicked\":\n      var ship = event.ship ;\n      var component = event.id ;\n      if (component == \"warp\") // check that this is our component \"warp\"\n      {\n        warpShip(ship);\n      }\n      break ;\n  }\n} ;","customizing-the-scoreboard-or-radar#Customizing the scoreboard or radar":"The built-in scoreboard or radar can be replaced by your own custom scoreboard/radar component. As soon as an UI component with id \"scoreboard\" or \"radar_background\" is created, you will be responsible for updating the scoreboard/radar. Your custom scoreboard/radar component does not have to include a position because it will automatically fill the area already reserved for the perspective UI Component.","global-ui#Global UI":"You can use game.setUIComponent({ options }) to set the UI to all current players in the game","other-methods-and-instances#Other methods and instances":"","remove-all-ships-secondary-slots#Remove all ship's secondary slots":"Syntax: ship.emptyWeapons()"}},"/docs/Main_Code_Parts/Step":{"title":"Step","data":{"game-step#Game step":"","definition#Definition":"Can be accessible through game.step; an integer presenting the game's duration","unit#Unit":"The unit of this value is tick, where 1 tick = 1/60 secondsWhich means that 60 ticks = 1 second, 120 ticks = 2 seconds and so on.","uses#Uses":"This code uses to set the first ship in the list to the center of the map in the first minute of the mod and reset its crystals every 5 seconds (assume that there is one ship staying from the start of the mod):\nthis.tick = function (game)\n{\n  if (game.step == 3600) { // 1 minute = 60 seconds * 60\n    game.ships[0].set({x:0,y:0}); // Center teleport\n  }\n  if (game.step % 300 === 0) { // 5 seconds * 60\n    game.ships[0].set({crystals: 0}); // Reset crystals\n  }\n}"}},"/docs/Main_Code_Parts/Tips":{"title":"Tips","data":{"modding-tips-and-tricks#Modding tips and tricks":"","how-can-i-set-the-sun-in-my-mod-to-be-like-this-which-could-be-seen-in-every-acwaow-games#How can I set the sun in my mod to be like this (which could be seen in every ACW/AOW games)?":"The special sun in the AOW\nYou will only need to set max_players to a value higher or equal to 200, and root_mode as \"team\""}},"/docs/Main_Code_Parts/Ticking":{"title":"Ticking","data":{"ticking#Ticking":"","definition#Definition":"Found in this.tick is a JavaScript function that is called 60 times per second. In this function’s body, you will be able to code specific actions that your mod needs to take automagically while the game is running. This function can be modified while the modded game is running and the changes will apply automagically.","events#Events":"","general#General":"Your mod can receive events through the function  this.event:\nthis.event = function(event,game) {\n  switch (event.name)\n  {\n    case \"ship_spawned\":\n      if (event.ship != null)\n      {\n        shipJustSpawned(event.ship) ;\n      }\n      break ;\n  }\n} ;","available-events#Available events":"Event name\tDescription\tAdditional event fields\tship_spawned*\tA ship just spawned in game or respawned\tevent.ship\tship_destroyed\tA ship was just destroyed\tevent.ship, event.killer\talien_destroyed\tAn alien was just killed\tevent.alien, event.killer\tasteroid_destroyed\tA movable asteroid was just destroyed (this event won't trigger for non-movable asteroids)\tevent.asteroid, event.killer\tcollectible_picked\tA ship just picked a collectible item\tevent.collectible, event.ship\tui_component_clicked\tA ship just clicked a (clickable) UI component on their screen\tevent.ship, event.id\t\nNote: * means that this event only works with unspecified root_mode (root_mode: \"\")"}},"/docs/Running_Mod":{"title":"Running and testing a mod","data":{"change-region#Change region":"Once your mod code is ready, in the console, start by selecting your preferred region for modding using the command region region <region name>.\nFor example with Europe:\n> region Europe\nRegion set to Europe\n> █","start-mod#Start mod":"Then to start running your mod, type command start:\n> start\nMod started\nhttps://starblast.io#1234@12.34.56.78:2000\nUse 'test' to open game frame for testing\n> █\nAs instructed by the console, you may want to open a test window to join your modded game with a Starblast client. Type test:\n> test\n> █\nALWAYS keep the Mod Editor Tab being active while running the mod!This is one of the most important things you need to keep in your mind!Why? Because that's nuances of how browsers work.Browsers slow down all javascript in non-active tabs in order to decrease the CPU processes.\nFor some mods (e.g Battle Royale), it doesn't matter like with ship tree and options only,\nbut for other mods where some logic in tick function or events - it will affect them A LOT!Ticks start to work slower and slower...Soon everything will be lagging in game; any reactions on mod buttons, any mod logic like spawning something in tick, etc.\nAnd... depending on mod complexity it can CRASH THE ENTIRE MOD - locally, server will continue to work so game will still run but without mod logic anymore.\nSo, always keep the mod editor tab online or you may have unpredictable results!Also, you need to have a stable internet connection if you don't want your mods becoming laggy.","stop-the-currently-running-mod#Stop the currently running mod":"You can stop your mod anytime by using the command stop. Note that this will kill the game and disconnect all connected players:\n> stop\nMod stopped\n> █","other-terminal-commands#Other terminal commands":"Command\tDescription\tSyntax\techo\tPrint any values to the terminal; can be used in both mod code (after mod started) and terminal\techo(<item>) echo(\"Hello, World!\")\tclear\tClear the terminal, only available in the terminal\tclear\thelp\tDisplay help message inside the terminal, terminal use only\thelp"}},"/":{"title":"Information","data":{"":"Standard Modding Interface, you can see the minimap of the mod in the bottom right corner while the mod is running\nStarblast Modding interface can be found here: https://starblast.io/modding.html (ECP required)Starblast Modding interface allows you to create custom mods for Starblast. The interface is made of a code editor window, on the left, and a console window, on the right. The code editor is where you type the JavaScript code for your mod. The console is where you can type commands to start your mod, stop it or interact with it while it is running.Main programming language used in this interface is JavaScript (ECMAScript)"}}}